vidorado/truminus/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.4.0 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32p4"

# ── Chip revision: support ECO2 (v1.x) silicon ───────────────────────────
# IDF 6.0 default is REV_MIN_301 (rev 3.1+) which won't run on this ECO2.
# SELECTS_REV_LESS_V3 unlocks _0/_1/_100 options.  REV_MIN_1 = v0.1+, max
# REV_MAX_FULL=199, so binary supports any v0.1..v1.99 chip including ECO2.
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_1=y

# ── Primary console on USB-Serial-JTAG ───────────────────────────────────
# /dev/ttyACM0 is the P4's native USB-Serial-JTAG, not UART0 (the latter
# is on header pins and not wired on this dev setup).  Keeping the
# primary console here lets the esp_console REPL bind input + output to
# the same port the developer connects to with picocom / idf.py monitor.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# ── DRAM pressure relief for mbedtls + ESP-Hosted SDIO ───────────────────
# Symptom (2026-05): WSS handshake fails with MBEDTLS_ERR_SSL_ALLOC_FAILED
# (-0x3B00) right after WiFi gets an IP, and the C6 SDIO RX path asserts
# at sdio_drv.c:953 because heap_caps_malloc(DMA) returns NULL.  Both are
# the same root cause: internal DRAM exhausted while bringing TLS up.
#
# 1. Default mbedtls allocator (was INTERNAL only) → big chunks land in
#    PSRAM via the global heap, only DMA-tagged allocs stay internal.
# 2. Lower the "always internal" threshold so allocations as small as 2 KB
#    can spill to PSRAM (IDF default was 16 KB, which kept almost
#    everything mbedtls touches in DRAM).
# 3. Shrink the TLS input record buffer from 16 KB → 4 KB.  WSS frames
#    from the Plesk bridge are small JSON / binary chunks (IO_CHUNK=4096
#    on both sides), so 16 KB was pure overhead.
CONFIG_MBEDTLS_INTERNAL_MEM_ALLOC=n
CONFIG_MBEDTLS_DEFAULT_MEM_ALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=2048
CONFIG_MBEDTLS_SSL_IN_CONTENT_LEN=4096

CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions_16MB.csv"
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=10240
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_VTASKLIST_INCLUDE_COREID=y
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y
CONFIG_LV_USE_CLIB_MALLOC=y
CONFIG_LV_USE_CLIB_STRING=y
CONFIG_LV_USE_CLIB_SPRINTF=y
CONFIG_LV_DEF_REFR_PERIOD=15
CONFIG_LV_OS_FREERTOS=y
CONFIG_LV_DRAW_SW_DRAW_UNIT_CNT=2
# LV_ATTRIBUTE_FAST_MEM_USE_IRAM=y triggers GCC-15 -Werror=attributes due to
# inconsistent .iram section numbering in LVGL 9.5.0 sw blend code; leave off.
# CONFIG_LV_ATTRIBUTE_FAST_MEM_USE_IRAM is not set
CONFIG_LV_FONT_MONTSERRAT_12=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_18=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_22=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_26=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_USE_FONT_COMPRESSED=y
CONFIG_LV_TXT_BREAK_CHARS=" ,.;:-_"
# SysMon shows FPS / CPU overlay — useful for benchmarks, off in production.
# CONFIG_LV_USE_SYSMON is not set
# CONFIG_LV_USE_PERF_MONITOR is not set
CONFIG_LV_USE_TINY_TTF=y
CONFIG_LV_USE_IMGFONT=y
CONFIG_LV_USE_DEMO_WIDGETS=y
CONFIG_LV_USE_DEMO_BENCHMARK=y
CONFIG_LV_USE_DEMO_RENDER=y
CONFIG_LV_USE_DEMO_SCROLL=y
CONFIG_LV_USE_DEMO_STRESS=y
CONFIG_LV_USE_DEMO_TRANSFORM=y
CONFIG_LV_USE_DEMO_MUSIC=y
CONFIG_LV_DEMO_MUSIC_AUTO_PLAY=y
CONFIG_LV_USE_DEMO_FLEX_LAYOUT=y
CONFIG_LV_USE_DEMO_MULTILANG=y
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
CONFIG_BSP_JC4880P443C_LCD_BL_GPIO=23
CONFIG_SPI_FLASH_SUPPORT_BOYA_CHIP=y

# ── ESP-Hosted: WiFi + BLE via ESP32-C6 co-processor over SDIO ───────────
CONFIG_ESP_HOSTED_ENABLED=y
CONFIG_ESP_HOSTED_SDIO_HOST_INTERFACE=y
CONFIG_ESP_HOSTED_IDF_SLAVE_TARGET="esp32c6"
CONFIG_ESP_HOSTED_SDIO_SLOT_1=y
CONFIG_ESP_HOSTED_SDIO_4_BIT_BUS=y
CONFIG_ESP_HOSTED_SDIO_CLOCK_FREQ_KHZ=40000
CONFIG_ESP_HOSTED_SDIO_PIN_CMD=19
CONFIG_ESP_HOSTED_SDIO_PIN_CLK=18
CONFIG_ESP_HOSTED_SDIO_PIN_D0=14
CONFIG_ESP_HOSTED_SDIO_PIN_D1=15
CONFIG_ESP_HOSTED_SDIO_PIN_D2=16
CONFIG_ESP_HOSTED_SDIO_PIN_D3=17
CONFIG_ESP_HOSTED_SDIO_GPIO_RESET_SLAVE=54
CONFIG_ESP_WIFI_REMOTE_ENABLED=y
CONFIG_ESP_WIFI_REMOTE_LIBRARY_HOSTED=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# BLE via C6 co-processor virtual HCI (ESP-Hosted).
# NimBLE host runs on the P4; HCI packets are routed to the C6 over SDIO.
# CONFIG_BT_NIMBLE_ENABLED must be set before CONFIG_ESP_HOSTED_ENABLE_BT_NIMBLE
# is visible in Kconfig (it depends on BT_NIMBLE_ENABLED).
CONFIG_BT_ENABLED=y
CONFIG_BT_CONTROLLER_DISABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
# Disable UART HCI transport (default y when BT_CONTROLLER_DISABLED) so that
# the ESP_HOSTED_ENABLE_BT_NIMBLE Kconfig option becomes visible.
# The VHCI transport (ESP-Hosted → C6 over SDIO) is used instead.
CONFIG_BT_NIMBLE_TRANSPORT_UART=n
CONFIG_ESP_HOSTED_ENABLE_BT_NIMBLE=y
CONFIG_ESP_HOSTED_NIMBLE_HCI_VHCI=y

# Web server: enable native WebSocket support in esp_http_server.
CONFIG_HTTPD_WS_SUPPORT=y
# Post-handshake callback fires once per new WS client → bump wsClientCount
# accurately (the URI handler is invoked only for frames, never for the
# upgrade leg, so we cannot count clients from inside it).
CONFIG_HTTPD_WS_POST_HANDSHAKE_CB_SUPPORT=y

# LWIP global socket pool.  Each tunneled browser request uses 2 LWIP fds
# (our client side + the httpd-accepted side), plus the httpd listener,
# the WSS control client, and a handful for WiFi/DHCP/DNS.  Default of 10
# is exhausted as soon as a browser fetches a multi-asset page through
# the tunnel; raise to comfortably hold ~8 concurrent streams.
CONFIG_LWIP_MAX_SOCKETS=40

# LWIP TCP PCB pool — every loopback tunnel stream consumes two PCBs
# (our client end + the httpd-accepted end on the same stack) plus a
# 60 s TIME_WAIT lingering after close.  Default 16 was getting blown
# the moment a browser loaded a multi-asset page through the tunnel,
# manifesting as `accept (errno 113 / EHOSTUNREACH / ERR_RTE)` because
# lwip couldn't allocate a PCB for the next connection.
CONFIG_LWIP_MAX_ACTIVE_TCP=64

# Modern browsers send 1.5–2 KB of headers per request (cookies, sec-ch-ua,
# accept-encoding…).  esp_http_server's default 512 / our previous 1024 are
# both too tight: requests through the tunnel get rejected with "Header
# fields are too long" (HTTP 431).  Each accepted connection allocates
# this buffer once, so the cost is bounded by max_open_sockets.
CONFIG_HTTPD_MAX_REQ_HDR_LEN=4096
CONFIG_HTTPD_MAX_URI_LEN=1024

# ── ECDSA peripheral not present on ESP32-P4 rev < v3 (esp32p4_es) ────────
# The ECDSA hardware accelerator is missing on the pre-production silicon on
# this board, so MBEDTLS_HARDWARE_ECDSA_VERIFY makes the PSA driver log
# "ECDSA peripheral not supported on this chip revision" on every ECDSA
# verify during the TLS handshake (GitHub OTA check / WSS tunnel).  Disable
# it so cert-chain verification runs in software (mbedtls) cleanly.
CONFIG_MBEDTLS_HARDWARE_ECDSA_VERIFY=n
